---
kind: property
id: P:Autodesk.Revit.DB.ModelPath.CentralServerPath
source: html/8026990f-77d8-af4e-dc6b-1d249a5dbb1f.htm
---
# Autodesk.Revit.DB.ModelPath.CentralServerPath Property

The path to the location of the central Revit server or cloud.

## Syntax (C#)
```csharp
public string CentralServerPath { get; }
```